# Лекция: Одномерные массивы в C#

## Что такое массив?

Массив — это упорядоченный набор элементов **одного типа**, хранящихся в памяти под одним именем.  
Можно представить массив как список ячеек, где каждая ячейка имеет свой номер (индекс).

Пример:  
`[10, 20, 30, 40]` — это массив из 4 целых чисел.

---

## Зачем нужны массивы?

Без массивов пришлось бы создавать отдельную переменную для каждого значения:

```csharp
int a1 = 10;
int a2 = 20;
int a3 = 30;
// ... и так далее
```

С массивом всё проще:

```csharp
int[] numbers = {10, 20, 30, 40};
```

---

## Объявление и создание массива

В C# есть несколько способов создать одномерный массив.

### Способ 1: Через `new` и указание размера

```csharp
int[] numbers = new int[5]; // массив из 5 целых чисел (по умолчанию — нули)
```

### Способ 2: Инициализация при создании

```csharp
int[] numbers = {1, 2, 3, 4, 5};
```

### Способ 3: Через `new` с инициализацией

```csharp
int[] numbers = new int[] {1, 2, 3, 4, 5};
```

> 💡 Тип элементов может быть любым: `string`, `double`, `bool`, даже собственные классы.

---

## Доступ к элементам массива

Элементы массива нумеруются **с нуля**.  
Первый элемент — индекс `0`, второй — `1`, и так далее.

```csharp
int[] numbers = {10, 20, 30, 40};

Console.WriteLine(numbers[0]); // выведет 10
Console.WriteLine(numbers[2]); // выведет 30

numbers[1] = 99; // изменяем второй элемент
Console.WriteLine(numbers[1]); // теперь выведет 99
```

> ⚠️ Если попытаться обратиться к несуществующему индексу (например, `numbers[10]` в массиве из 4 элементов), программа выдаст ошибку **IndexOutOfRangeException**.

---

## Длина массива

У каждого массива есть свойство `Length`, которое возвращает количество элементов:

```csharp
int[] numbers = {1, 2, 3, 4, 5};
Console.WriteLine(numbers.Length); // выведет 5
```

---

## Перебор массива

### Способ 1: Цикл `for`

```csharp
int[] numbers = {10, 20, 30, 40};

for (int i = 0; i < numbers.Length; i++)
{
    Console.WriteLine(numbers[i]);
}
```

### Способ 2: Цикл `foreach` (удобен, если не нужен индекс)

```csharp
int[] numbers = {10, 20, 30, 40};

foreach (int number in numbers)
{
    Console.WriteLine(number);
}
```

---

## Пример: Найти сумму элементов массива

```csharp
int[] numbers = {1, 2, 3, 4, 5};
int sum = 0;

foreach (int num in numbers)
{
    sum += num;
}

Console.WriteLine($"Сумма: {sum}"); // Сумма: 15
```

---

## Важные моменты

- Массив в C# — это **ссылочный тип**. Это значит, что переменная массива хранит не сами данные, а ссылку на них в памяти.
- Размер массива **нельзя изменить** после создания. Если нужно динамически менять размер — используйте `List<T>` (но это уже другая тема).
- Все элементы массива **должны быть одного типа**.

---

## Практика

Попробуйте сами:

1. Создайте массив из 5 строк и выведите их по одной.
2. Создайте массив из 10 случайных чисел (используйте `Random`) и найдите максимальное значение.
3. Напишите программу, которая меняет местами первый и последний элементы массива.

---

## Заключение

Одномерные массивы — это базовый, но очень важный инструмент в программировании. Они позволяют удобно хранить и обрабатывать наборы данных. Освоив массивы, вы сможете решать множество практических задач!